# Pandas

In [2]:
import pandas as pd
import numpy as np

## Pandas Objects
* Access array using labels rather than simple integer indices.
* DataFrame
* Series
* Index

## Series Object
Series is a one-dimensional array of indexed data.

### Number as Index for Series

In [3]:
series = pd.Series([0.25, 0.5, 0.75, 1.0])
series

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
series.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
series.values

array([0.25, 0.5 , 0.75, 1.  ])

In [72]:
series_2 = pd.Series(np.arange(10, 100, 10))
series_2

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [73]:
series_2.index

RangeIndex(start=0, stop=9, step=1)

In [74]:
series_2.values

array([10, 20, 30, 40, 50, 60, 70, 80, 90])

### String as Index for Series

In [13]:
series_3 = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
series_3

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
series_3['c']

0.75

### Series vs Python Dictionary
* Series can be created from dictionary
* Series has more efficient operations

In [15]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [16]:
population['California']

38332521

In [17]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [ ]:
population_dict['California':'Illinois'] # Error

In [20]:
population_dict['California'] # Ok

38332521

## DataFrame Object
* Think of ```DataFrame``` as a sequence of ```Series``` Objects

In [22]:
area_dict = {'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [23]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [24]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [25]:
states.columns

Index(['population', 'area'], dtype='object')

In [27]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [31]:
california = states.loc['California']
print(california)
print(type(california))

population    38332521
area            423967
Name: California, dtype: int64
<class 'pandas.core.series.Series'>

## Index Object
* Immutable Array
* Ordered Set

In [32]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [33]:
ind[1]

3

In [34]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [ ]:
ind[1] = 100 # Error

## Data Indexing & Selection
* In series 
* In DataFrame

### In Series

In [36]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [37]:
data['b']

0.5

In [38]:
'a' in data

True

In [75]:
data.keys()

Index(['area', 'pop', 'density'], dtype='object')

In [41]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [42]:
list(data.items())[0]

('a', 0.25)

In [44]:
type(list(data.items())[0])

tuple

In [45]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [48]:
data[2:]

c    0.75
d    1.00
dtype: float64

In [51]:
data[['c', 'd']]

c    0.75
d    1.00
dtype: float64

### Indexers
* loc -  indexing and slicing that always references the ```explicit``` index
* iloc - indexing and slicing that always references the ```implicit``` Python-style index
* ix - hybrid of these two approaches(deprecated)

In [53]:
data.loc['a']

0.25

In [55]:
data.iloc[0]

0.25

In [77]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [78]:
data.loc[1]

'a'

In [79]:
data.iloc[1]

'b'

### In DataFrame

In [81]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [82]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [57]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [58]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [60]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [61]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [83]:
data_T = data.T
data_T['California']

area      423967
pop     38332521
Name: California, dtype: int64

In [71]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [67]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [69]:
data.ix[:3, :'pop'] # Deprecated - do not use

/usr/local/Cellar/ipython/7.5.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

## Merge & Join
* One essential feature offered by Pandas is its high-performance, in-memory join and merge operations.
* Similar to databases
* pd.merge

## Type of Joins
* one-to-one
* many-to-one
* one-to-many

### One-to-one joins

In [92]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [97]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [98]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [99]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

The ``pd.merge()`` function recognizes that each ``DataFrame`` has an "employee" column, and automatically joins using this column as a key.

### Many-to-one joins

In [101]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [102]:
df5 = pd.merge(df3, df4)
df5

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

### Many-to-many joins

In [103]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [106]:
df6 = pd.merge(df1, df5)
df6

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Special Keywords
* on
* left_on
* right_on
* left_index
* right_index

In [107]:
df7 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df7

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [108]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [110]:
df8 = pd.merge(df1, df7, left_on='employee', right_on='name')
df8

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [111]:
df8[['employee', 'group', 'salary']]

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [115]:
df1a = df1
df7a = df7
df1a.set_index('employee')
df7a.set_index('name')
df9 = pd.merge(df1a, df7a, left_index=True, right_index=True)
# df9 = pd.merge(df1a, df7a) # Error
df9

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [117]:
df10 = df1a.join(df7a)
df10

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

## Example: US Population

In [122]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [124]:
pop.isnull().any()

state/region    False
ages            False
year            False
population       True
dtype: bool

In [125]:
pop.dropna(inplace=True)

In [126]:
pop.isnull().any()

state/region    False
ages            False
year            False
population      False
dtype: bool

In [130]:
areas.isnull().any()

state            False
area (sq. mi)    False
dtype: bool

In [131]:
abbrevs.isnull().any()

state           False
abbreviation    False
dtype: bool

In [136]:
merged = pd.merge(pop, abbrevs, how='outer', left_on='state/region', right_on='abbreviation')
merged.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [146]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state abbreviation  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama           AL        52423.0
1           AL    total  2012   4817528.0  Alabama           AL        52423.0
2           AL  under18  2010   1130966.0  Alabama           AL        52423.0
3           AL    total  2010   4785570.0  Alabama           AL        52423.0
4           AL  under18  2011   1125763.0  Alabama           AL        52423.0

In [147]:
final.isnull().any()

state/region     False
ages             False
year             False
population       False
state             True
abbreviation      True
area (sq. mi)     True
dtype: bool

In [148]:
final.tail()

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
2519,USA,total,2010,309326295.0,NaN,NaN,NaN
2520,USA,under18,2011,73902222.0,NaN,NaN,NaN
2521,USA,total,2011,311582564.0,NaN,NaN,NaN
2522,USA,under18,2012,73708179.0,NaN,NaN,NaN
2523,USA,total,2012,313873685.0,NaN,NaN,NaN

In [149]:
final.dropna(inplace=True)
final.tail()

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
2443,WY,under18,1993,137458.0,Wyoming,WY,97818.0
2444,WY,total,1991,459260.0,Wyoming,WY,97818.0
2445,WY,under18,1991,136720.0,Wyoming,WY,97818.0
2446,WY,under18,1990,136078.0,Wyoming,WY,97818.0
2447,WY,total,1990,453690.0,Wyoming,WY,97818.0

In [151]:
data2010 = final.query("year == 2010 & ages == 'under18'")
data2010.head()

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
2,AL,under18,2010,1130966.0,Alabama,AL,52423.0
90,AK,under18,2010,187902.0,Alaska,AK,656425.0
100,AZ,under18,2010,1628563.0,Arizona,AZ,114006.0
188,AR,under18,2010,711947.0,Arkansas,AR,53182.0
196,CA,under18,2010,9284094.0,California,CA,163707.0

In [153]:
density = data2010['population'] / data2010['area (sq. mi)']
density.head()

2      21.573851
90      0.286251
100    14.284889
188    13.386992
196    56.711649
dtype: float64

### Need to change index

In [154]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']
density.head()

state
Alabama       21.573851
Alaska         0.286251
Arizona       14.284889
Arkansas      13.386992
California    56.711649
dtype: float64

In [156]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    1489.838235
New Jersey               236.415157
Connecticut              146.859127
Rhode Island             144.393528
Massachusetts            134.150829
dtype: float64

In [157]:
density.tail()

state
South Dakota    2.634107
North Dakota    2.124052
Montana         1.518518
Wyoming         1.383702
Alaska          0.286251
dtype: float64

### Function for displying datasets

In [121]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Other Topics
* Missing Values
* Aggregation & Grouping
* Pandas and Time Series